# Data Load into postgreSQL database

In [1]:
# Import Dependencies
import pandas as pd
from sqlalchemy import create_engine

In [2]:
# Read in water CSV files to be loaded to database
water_csv = "water.csv"
water = pd.read_csv(water_csv)
water.head()

  country  year  accessibility_percentage
0     AFG  2000                  27.77190
1     AFG  2001                  27.79726
2     AFG  2002                  29.90076
3     AFG  2003                  32.00507
4     AFG  2004                  34.12623

In [3]:
# Read in mortality CSV files to be loaded to database
mortalities_csv = "mortalities.csv"
mortalities = pd.read_csv(mortalities_csv)
mortalities.head()

  country  year gender  mortality_rate
0     AFG  1962   BTSX       344.62950
1     AFG  1963   BTSX       338.71554
2     AFG  1964   BTSX       333.10666
3     AFG  1965   BTSX       327.56087
4     AFG  1966   BTSX       322.04611

In [4]:
# connect to database
connection_string = "USERNAME:PASSWORD@localhost:5432/Water_Mortalities"
engine = create_engine(f'postgresql://{connection_string}')

In [5]:
# confirm tables
engine.table_names()

['water', 'mortalities']

 # Load dataframes into database

In [6]:
# use pandas to load dataframes to database
water.to_sql(name='water', con=engine, if_exists='append', index=False)
mortalities.to_sql(name='mortalities', con=engine, if_exists='append', index=False)

In [7]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from water', con=engine).head()

   id country  year  accessibility_percentage
0   1     AFG  2000                      28.0
1   2     AFG  2001                      28.0
2   3     AFG  2002                      30.0
3   4     AFG  2003                      32.0
4   5     AFG  2004                      34.0

In [8]:
# Check that dataframes have loaded successfully
pd.read_sql_query('select * from mortalities', con=engine).head()

   id country  year gender  mortality_rate
0   1     AFG  1962   BTSX             345
1   2     AFG  1963   BTSX             339
2   3     AFG  1964   BTSX             333
3   4     AFG  1965   BTSX             328
4   5     AFG  1966   BTSX             322